'''
한수
시간 제한	메모리 제한	제출	정답	맞은 사람	정답 비율
2 초	128 MB	70163	36549	30983	52.175%

문제
어떤 양의 정수 X의 각 자리가 등차수열을 이룬다면, 그 수를 한수라고 한다. 
등차수열은 연속된 두 개의 수의 차이가 일정한 수열을 말한다. 
N이 주어졌을 때, 1보다 크거나 같고, N보다 작거나 같은 한수의 개수를 출력하는 프로그램을 작성하시오. 

입력
첫째 줄에 1,000보다 작거나 같은 자연수 N이 주어진다.

출력
첫째 줄에 1보다 크거나 같고, N보다 작거나 같은 한수의 개수를 출력한다.

예제 입력 1     예제 출력 1 
110             99
예제 입력 2     예제 출력 2 
1               1
예제 입력 3     예제 출력 3 
210             105
예제 입력 4     예제 출력 4 
1000            144
'''

def hansu(n):
    count = 0
    for i in range(1,n+1):
        if i < 100:
            count += 1
        else:
            # if i//100 - (i-(i//100)*100)//10 == (i-(i//100)*100)//10 - (i-(i//100)*100 - (i-(i//100)*100)//10*10):
            if i//100-i//10%10==i//10%10-i%10
                count += 1
    return count

num = int(input())
print(hansu(num))

print(sum((N//100-N//10%10==N//10%10-N%10)|(N<100)for N in range(1,int(input())+1)))