'''
시험 성적
시간 제한	메모리 제한	제출	정답	맞은 사람	정답 비율
1 초	128 MB	137863	77358	68175	57.403%

문제
시험 점수를 입력받아 90 ~ 100점은 A, 80 ~ 89점은 B, 70 ~ 79점은 C, 
60 ~ 69점은 D, 나머지 점수는 F를 출력하는 프로그램을 작성하시오.

입력
첫째 줄에 시험 점수가 주어진다. 시험 점수는 0보다 크거나 같고, 100보다 작거나 같은 정수이다.

출력
시험 성적을 출력한다.

예제 입력 1 
100
예제 출력 1 
A
'''

a = int(input())
my_dict = {90<=a<=100: 'A', 80<=a<90: 'B', 70<=a<80: 'C', 60<=a<70: 'D'}.get(True, 'F')
print(my_dict)

a = int(input())
if a>=90: print('A')
elif a>=80: print('B')
elif a>=70: print('C')
elif a>=60: print('D')
else: print('F')